---
kind: property
id: P:Autodesk.Revit.DB.Visual.Glazing.GlazingNoLevels
source: html/dec6673e-dadf-2fce-9bc9-ea4d8bc93f89.htm
---
# Autodesk.Revit.DB.Visual.Glazing.GlazingNoLevels Property

The property labeled "Sheets of Glass" from the "Glazing" schema.

## Syntax (C#)
```csharp
public static string GlazingNoLevels { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" within the range of "1, 6".